[
    {
        "id":1,
        "useranme": "Jemma T.",
        "avatar":"avatar2.jpg",
        "stars":5,
        "bookId":1,
        "date":"February 20, 2023",
        "text":[
            "As much as I LOVE the prisoner of Azkaban movie, I've always felt like there were missing details and reading this book definitely filled in the holes for me. The way that the author describes the hourglass scene is just amazing. Loved this book"
        ],
        "pictures":[

        ]
    },
    {
        "id":2,
        "useranme": "Eric Crim",
        "avatar":"avatar1.jpg",
        "stars":4,
        "bookId":1,
        "date":"December 13, 2020",
        "text":[
            "I bought this for my daughter who is getting into Harry Potter now. I didn't want to spend a lot of money since I'm trying to buy all the books. I'm very satisfied with the seller, the book matched their description perfectly.."
        ],
        "pictures":[

        ]
    },
    {
        "id":3,
        "useranme": "Dylan Silverstein",
        "avatar":"default-avatar.jpg",
        "stars":5,
        "bookId":1,
        "date":"August 13, 2019",
        "text":[
            "As always with Rowling's books, I loved Harry Potter and the Prisoner of Azkaban! JK Rowling's words have a curious habit of coming to life, and her characters are funny, and realistic. One of the greatest things about Harry Potter, is that they improve with each book, and you can clearly glimpse the clever, intricate plot Rowling has wove, with cleverly placed foreshadowing and seemingly innocent hints."
        ],
        "pictures":[
            "commentpic1.jpg"
        ]
    },
    {
        "id":4,
        "useranme": "mdcool1234",
        "avatar":"default-avatar.jpg",
        "stars":4,
        "bookId":1,
        "date":"October 12, 2018",
        "text":[
            "In this book, as Harry approaches adolescence the tone changes. And we get a more interesting, but also more complex and darker story.",

            "Unlike the static characters in other books or series, Harry is getting older, and getting less stable emotionally. The book still appeals to both children and adults but it involves some horror creatures, Dementors and there is lot of focus on Harry's parents' deaths.",

            "The great thing for children is that the familiar, relatable characters are being brought to life and come across as very realistic. Harry's friendship with Ron and Hermione takes a different direction in this instalment. Hermione is being forced to make tough choices that impact Harry but Ron in particular. With who she is in constant disagreement. But the book also has an exceptionally strong set of secondary characters like Professor Lupin, the Defense Against the Dark Arts teacher, a great new character that hides a big hairy secret. Then there is Professor Trelawney for Divination studies. While Hagrid displays his love of all magical creatures. Professor Snape remains enigmatic so that you continue to question his true motives. Cedric Diggory and Cho Chang, who play important roles in later books of the series are introduced as well"
        ],
        "pictures":[
            "commentpic2.jpg",
            "commentpic3.jpg",
            "commentpic4.jpg"            
        ]
    },
    {
        "id":5,
        "useranme": "Sean Brannon",
        "avatar":"default-avatar.jpg",
        "stars":4,
        "bookId":1,
        "date":"February 28, 2020",
        "text":[
            "This is the third instalment as I attempt to read this so-called modern classic. I watched the first three or four films as they came out but abandoned reading the books after reading the first one twenty years ago. I was advised to persevere with them and that by the third one I would see what it was all about. This was easily better than the first two and I have begun to warm to the characters especially Ron and Hermione. The plot was also more complex than the first two and I felt it became a page turner towards the end which I hadn't experienced with the first two.",

            "I will continue and expect further rewards in the final four books. There is a whole universe in here which is admirable. If I am honest compared to Lord of the Rings there is no comparison in terms of the wonder contained. I may change my mind by book 7 . However, this is a huge step up from the first two. We will see."
        ],
        "pictures":[
            "commentpic5.jpg",
            "commentpic6.jpg",
            "commentpic7.jpg"
        ]
    },
    {
        "id":6,
        "useranme": "NeosoulNoona",
        "avatar":"avatar3.jpg",
        "stars":5,
        "bookId":1,
        "date":"June 4, 2018",
        "text":[
            "The third Harry Potter book is Rowling's best! The characters fee like your own best friends, the plot keeps you on your heels, and no fluff seems to be added to this book. I spend through this whenever I had a break in school and burned through the last 170 pages in one night. It's that good! If you like character driven stories, especially in a school-like setting, then this is a great book for you.",

            "I found the story in this book to be more complex and interesting then the first two. Harry shows some real emotion for the first time in the series. Overall, one of my favorite books I've read."
        ],
        "pictures":[
            "commentpic8.jpg"
        ]
    },
    {
        "id":7,
        "useranme": "Desirae Fields",
        "avatar":"default-avatar.jpg",
        "stars":2,
        "bookId":1,
        "date":"February 1, 2023",
        "text":[
            "I love the story but that is not why I bought the book! I bought this for my collection and waited awhile to receive it. When it came in the book was missing pages and the binding was broken. (See picture) I hope the return brings me a better book."
        ],
        "pictures":[
            "commentpic9.jpg",
            "commentpic10.jpg"
        ]
    },
    {
        "id":8,
        "useranme": "Angela",
        "avatar":"default-avatar.jpg",
        "stars":4,
        "bookId":2,
        "date":"February 13, 2023",
        "text":[
            "Corner is kinda broken but it seems nice"
        ],
        "pictures":[
            "commentpic11.jpg"
        ]
    },
    {
        "id":9,
        "useranme": "Alonso C",
        "avatar":"avatar4.jpg",
        "stars":5,
        "bookId":2,
        "date":"February 19, 2023",
        "text":[
            "We already know from the first book that Harry is going to encounter a scary, dangerous situation while at Hogwarts - and it is all about him. (Cue Voldemort and his minions.) Each subsequent book in the series brings additional characters into the life of Harry Potter. And with them come more knowledge, more mystery and more story lines.",

            "The fourth book of the series doesn't start out with Harry. Instead, we get a glimpse of the life of the Riddles - all who mysteriously die in the night of no determined cause. But each had a \"look of terror on his or her face\" and the long-time gardener overhears a plotting conversation and Harry awakes with his scar hurting. Oh boy.",

            "\"Difference of habit and language are nothing at all if our aims are identical and our hearts are open.\"",

            "Harry is looking forward to the end of his summer and the Quidditch World Cup, between Ireland and Bulgaria. Mr. Weasley has scored the best seats in the house for the Weasley clan and Ron's two friends. However, Harry takes note of some odd things Ron's older brother Percy (now working at the Ministry of Magic) says about some peculiarities at the Ministry, as well as some other abnormal things about two heads of Ministry departments, Crouch and Bagman, and the odd disappearance of Ministry woman in the last known location of You-Know-Who. Although the Quidditch match is quite rousing, something goes horribly wrong..."
        ],
        "pictures":[

        ]
    },
    {
        "id":10,
        "useranme": "Jemma T.",
        "avatar":"default-avatar.jpg",
        "stars":5,
        "bookId":2,
        "date":"August 7, 2010",
        "text":[
            "I cant put into words how good this rollercoaster of a book was 10000000/10. An absoulute master piece jkr is an amazing author"
        ],
        "pictures":[

        ]
    },
    {
        "id":11,
        "useranme": "Mike",
        "avatar":"avatar5.jpg",
        "stars":4,
        "bookId":3,
        "date":"July 17, 2005",
        "text":[
            "Before reading this book, I would've said that the Prisoner of Azkaban was my favorite so far in the series. Now, at the very least, the Half-Blood Prince is a close second.",

            "Even knowing what was to come in this book, it still brought me to tears at times. I feel like that says a lot.",

            "In late 1999, a friend gave me the first 3 Harry Potter books. I never read them, but passed them along to my mother. She instantly became a die-hard HP fan. From there, I pre-ordered her the rest of the series as it was released. We lost her in 2021 & finally reading these books has become a way for me to feel close to her."
        ],
        "pictures":[

        ]
    }
    
]